Autodesk.Revit.DB.TableSectionData.MergeCells(Autodesk.Revit.DB.TableMergedCell)
Merges cells for the given area.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.SetMergedCell(System.Int32,System.Int32,Autodesk.Revit.DB.TableMergedCell)
Sets the merged cell that this cell is a part of.
nRow:
The cell row.
nCol:
The cell column.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.